grevaillot/svd_tools/headers/STM32L4x3/memorymap.h
#pragma once 

#define TIM2_BASE			(0x40000000)
#define TIM6_BASE			(0x40001000)
#define TIM7_BASE			(0x40001400)
#define LCD_BASE			(0x40002400)
#define RTC_BASE			(0x40002800)
#define WWDG_BASE			(0x40002c00)
#define IWDG_BASE			(0x40003000)
#define SPI2_BASE			(0x40003800)
#define SPI3_BASE			(0x40003c00)
#define USART2_BASE			(0x40004400)
#define USART3_BASE			(0x40004800)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define I2C3_BASE			(0x40005c00)
#define CRS_BASE			(0x40006000)
#define CAN1_BASE			(0x40006400)
#define USB_BASE			(0x40006c00)
#define PWR_BASE			(0x40007000)
#define DAC1_BASE			(0x40007400)
#define OPAMP_BASE			(0x40007800)
#define LPTIM1_BASE			(0x40007c00)
#define LPUART1_BASE			(0x40008000)
#define SWPMI1_BASE			(0x40008800)
#define LPTIM2_BASE			(0x40009400)
#define SYSCFG_BASE			(0x40010000)
#define VREFBUF_BASE			(0x40010030)
#define COMP_BASE			(0x40010200)
#define EXTI_BASE			(0x40010400)
#define FIREWALL_BASE			(0x40011c00)
#define SDMMC_BASE			(0x40012800)
#define TIM1_BASE			(0x40012c00)
#define SPI1_BASE			(0x40013000)
#define USART1_BASE			(0x40013800)
#define TIM15_BASE			(0x40014000)
#define TIM16_BASE			(0x40014400)
#define SAI1_BASE			(0x40015400)
#define DMA1_BASE			(0x40020000)
#define DMA2_BASE			(0x40020400)
#define RCC_BASE			(0x40021000)
#define FLASH_BASE			(0x40022000)
#define CRC_BASE			(0x40023000)
#define TSC_BASE			(0x40024000)
#define GPIOA_BASE			(0x48000000)
#define GPIOB_BASE			(0x48000400)
#define GPIOC_BASE			(0x48000800)
#define GPIOD_BASE			(0x48000c00)
#define GPIOE_BASE			(0x48001000)
#define GPIOH_BASE			(0x48001c00)
#define ADC_BASE			(0x50040000)
#define AES_BASE			(0x50060000)
#define RNG_BASE			(0x50060800)
#define SCB_ACTRL_BASE			(0xe000e008)
#define STK_BASE			(0xe000e010)
#define NVIC_BASE			(0xe000e100)
#define SCB_BASE			(0xe000ed00)
#define FPU_CPACR_BASE			(0xe000ed88)
#define MPU_BASE			(0xe000ed90)
#define NVIC_STIR_BASE			(0xe000ef00)
#define FPU_BASE			(0xe000ef34)
#define DBGMCU_BASE			(0xe0042000)
